lvx/base/Catalogs/бит_ПоказателиПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПоказателиПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_НастройкиПроизвольныхОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЯчейки</Name>
					<Comment>Вид ячейки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЯчеекПроизвольногоОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Comment>Элемент данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьДвиженияПоБюджету</Name>
					<Comment>Формировать движения по бюджету</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДанных</Name>
					<Comment>Период данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаТаблицыОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаТаблицыОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличественныйУчет</Name>
					<Comment>0 - суммовой, 1  - количественный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоУмолчанию</Name>
					<Comment>Значения по умолчанию</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Comment>Имя аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Comment>Аналитика</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Comment>Значение аналитики</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аргументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аргумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоказателиПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ПоказателиПроизвольныхОтчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция создает новый показатель произвольного отчета.
// 
// Параметры:
//  НастройкаОтчета  - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
//  СтруктураПараметров  - Структура.
// 
// Возвращаемое значение:
//   Показатель   - СправочникСсылка.бит_ПоказателиПроизвольныхОтчетов.
// 
Функция СоздатьПоказатель(НастройкаОтчета,СтруктураПараметров) Экспорт
	
	Показатель   = Справочники.бит_ПоказателиПроизвольныхОтчетов.ПустаяСсылка();
	
	ПоказательОб = Справочники.бит_ПоказателиПроизвольныхОтчетов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ПоказательОб,СтруктураПараметров);
	ПоказательОб.Владелец     = НастройкаОтчета;
	ПоказательОб.Код          = СтруктураПараметров.ИмяОбласти;
	ПоказательОб.Наименование = АвтоНаименование(ПоказательОб);
	ПоказательОб.КолонкаТаблицыОтчета = СтруктураПараметров.КолонкаТаблицыОтчета;
	ПоказательОб.СтрокаТаблицыОтчета  = СтруктураПараметров.СтрокаТаблицыОтчета;
	
	Если СтруктураПараметров.Свойство("ЗначенияПоУмолчанию") Тогда
		ПоказательОб.ЗначенияПоУмолчанию.Загрузить(СтруктураПараметров.ЗначенияПоУмолчанию);
	КонецЕсли; 
	
	Если СтруктураПараметров.Свойство("ПометкаУдаления") Тогда
		ПоказательОб.ПометкаУдаления = СтруктураПараметров.ПометкаУдаления;	
	КонецЕсли;
	
	флДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(ПоказательОб,,"Ошибки");
	Если флДействиеВыполнено Тогда
		Показатель = ПоказательОб.Ссылка;
	КонецЕсли;
	
	Возврат Показатель;
	
КонецФункции // СоздатьПоказатель()

// Функция выполняет обновление показателя произвольного отчета.
// 
// Параметры:
//  ТекПоказатель        - СправочникСсылка.бит_ПоказателиПроизвольныхОтчетов.
//  СтруктураПараметров  - Структура.
// 
// Возвращаемое значение:
//   флДействиеВыполнено   - Булево.
// 
Функция ОбновитьПоказатель(ТекПоказатель,СтруктураПараметров) Экспорт
	
	Успех = Истина;
	
	Записывать = Ложь;
	Поля 	   = Новый Структура;
	Таблицы    = Новый Структура; 
	
	Реквизиты = Реквизиты(ТекПоказатель);
	Для каждого КлючЗначение Из Реквизиты Цикл
		Если СтруктураПараметров.Свойство(КлючЗначение.Ключ) Тогда
			
			Если ТипЗнч(СтруктураПараметров[КлючЗначение.Ключ]) = Тип("ТаблицаЗначений") Тогда
				// Табличные части.
				ТаблицаОбъекта 	   = КопияТаблицыОбъекта(СтруктураПараметров[КлючЗначение.Ключ], КлючЗначение.Значение); 
				КоллекцииИдентичны = ОбщегоНазначения.КоллекцииИдентичны(
										КлючЗначение.Значение, ТаблицаОбъекта);
				Если НЕ КоллекцииИдентичны Тогда
					Записывать = Истина;
					Таблицы.Вставить(КлючЗначение.Ключ, ТаблицаОбъекта);
				КонецЕсли;
			Иначе
				// Шапка.
				Если КлючЗначение.Значение <> СтруктураПараметров[КлючЗначение.Ключ] Тогда
					Записывать = Истина;
					Поля.Вставить(КлючЗначение.Ключ, СтруктураПараметров[КлючЗначение.Ключ]);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла; 
	
	Если Записывать Тогда
		
		ТекущийОбъект = ТекПоказатель.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ТекущийОбъект,Поля);

		Для каждого Таблица Из Таблицы Цикл
			ТекущийОбъект[Таблица.Ключ].Очистить();
			Для каждого СтрокаТаблицы Из Таблица.Значение Цикл
				НоваяСтрока = ТекущийОбъект[Таблица.Ключ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла; 
		КонецЦикла;
		
		Успех = бит_ОбщегоНазначения.ЗаписатьСправочник(ТекущийОбъект,,"Ошибки");	
	КонецЕсли; 
	
	Возврат Успех;
	
КонецФункции // ОбновитьПоказатель()

// Функция выполняет удаление показателя.
// 
// Параметры:
//  ТекПоказатель        - СправочникСсылка.бит_ПоказателиПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//   флДействиеВыполнено   - Булево.
// 
Функция УдалитьПоказатель(ТекПоказатель) Экспорт

	Отказ 			 = Ложь;
	ПоказательОбъект = ТекПоказатель.ПолучитьОбъект();
	Попытка
		ПоказательОбъект.Заблокировать();
		ПоказательОбъект.УстановитьПометкуУдаления(Истина);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось удалить показатель %1 по причине ""%2""';
										|en = 'Failed to remove the value of %1 because the ""%2""'"), 
								   ТекПоказатель, 
								   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТекПоказатель,,,Отказ); 
	КонецПопытки;

	Возврат НЕ Отказ;
	
КонецФункции

// Функция получает показатели произвольного отчета определенного вида.
// 
// Параметры:
//  НастройкаОтчета - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
//  Вид             - ПеречислениеСсылка.бит_ВидыЯчеекПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//   ТаблицаЗначений
// 
Функция ПолучитьПоказателиВида(НастройкаОтчета, Вид, ВесьСписок = Ложь) Экспорт
	
	МассивВидов = Новый Массив;
	Если ТипЗнч(Вид) = Тип("Строка") Тогда		
		ТекВид = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета[Вид];
		МассивВидов.Добавить(ТекВид);   		
	ИначеЕсли ТипЗнч(Вид) = Тип("Массив") Тогда	
		МассивВидов = Вид; 		
	Иначе	     		
		МассивВидов.Добавить(Вид);   		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец"   , НастройкаОтчета);	
	Запрос.УстановитьПараметр("МассивВидов", МассивВидов); 
	Запрос.УстановитьПараметр("ВесьСписок",  ВесьСписок); 	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.ПометкаУдаления КАК ПометкаУдаления,
	|	Реквизиты.Владелец КАК Владелец,
	|	Реквизиты.Код КАК Код,
	|	Реквизиты.Код КАК ИмяОбласти,
	|	Реквизиты.Наименование КАК Наименование,
	|	Реквизиты.ВидЯчейки КАК ВидЯчейки,
	|	Реквизиты.ЭлементДанных КАК ЭлементДанных,
	|	Реквизиты.ИмяРесурса КАК ИмяРесурса,
	|	Реквизиты.Формула КАК Формула,
	|	Реквизиты.ФорматЧисел КАК ФорматЧисел,
	|	Реквизиты.ФормироватьДвиженияПоБюджету КАК ФормироватьДвиженияПоБюджету,
	|	Реквизиты.ПериодДанных КАК ПериодДанных,
	|	Реквизиты.КолонкаТаблицыОтчета КАК КолонкаТаблицыОтчета,
	|	Реквизиты.СтрокаТаблицыОтчета КАК СтрокаТаблицыОтчета,
	|	Реквизиты.СтрокаТаблицыОтчета.ТаблицаОтчета КАК ТаблицаОтчета,
	|	Реквизиты.ЗначенияПоУмолчанию.(
	|		ИмяАналитики КАК ИмяАналитики,
	|		Аналитика КАК Аналитика,
	|		ЗначениеАналитики КАК ЗначениеАналитики
	|	) КАК ЗначенияПоУмолчанию,
	|	Реквизиты.КоличественныйУчет КАК КоличественныйУчет,
	|	Реквизиты.Ссылка КАК ПоказательОтчета
	|ИЗ
	|	Справочник.бит_ПоказателиПроизвольныхОтчетов КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Владелец = &Владелец
	|	И Реквизиты.ВидЯчейки В(&МассивВидов)
	|	И (&ВесьСписок ИЛИ НЕ Реквизиты.ПометкаУдаления)";
	
	Результат  = Запрос.Выполнить();
	Показатели = Результат.Выгрузить();

	Возврат Показатели;
	
КонецФункции // ПолучитьПоказателиВида()

#КонецОбласти 	
 
#Область СлужебныеПроцедурыИФункции

Функция Реквизиты(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Код КАК Код,
	|	Реквизиты.Наименование КАК Наименование,
	|	Реквизиты.ВидЯчейки КАК ВидЯчейки,
	|	Реквизиты.ЭлементДанных КАК ЭлементДанных,
	|	Реквизиты.ИмяРесурса КАК ИмяРесурса,
	|	Реквизиты.Формула КАК Формула,
	|	Реквизиты.ФорматЧисел КАК ФорматЧисел,
	|	Реквизиты.ФормироватьДвиженияПоБюджету КАК ФормироватьДвиженияПоБюджету,
	|	Реквизиты.ПериодДанных КАК ПериодДанных,
	|	Реквизиты.КолонкаТаблицыОтчета КАК КолонкаТаблицыОтчета,
	|	Реквизиты.СтрокаТаблицыОтчета КАК СтрокаТаблицыОтчета,
	|	Реквизиты.ЗначенияПоУмолчанию.(
	|		ИмяАналитики КАК ИмяАналитики,
	|		Аналитика КАК Аналитика,
	|		ЗначениеАналитики КАК ЗначениеАналитики
	|	) КАК ЗначенияПоУмолчанию,
	|	Реквизиты.Аргументы.(
	|		Аргумент КАК Аргумент
	|	) КАК Аргументы,
	|	Реквизиты.КоличественныйУчет КАК КоличественныйУчет,
	|	Реквизиты.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.бит_ПоказателиПроизвольныхОтчетов КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРеквизиты = РезультатЗапроса.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
		
	Возврат Реквизиты;

КонецФункции // Реквизиты()
 
Функция КопияТаблицыОбъекта(Коллекция, Шаблон)

	Таблица = Шаблон.СкопироватьКолонки();
	Для каждого СтрокаТаблицы Из Коллекция Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла; 
	
	Возврат Таблица;
	
КонецФункции
 
// Функция формирует автоматическое наименование показателя.
// 
// Параметры:
//  Показатель  - СправочникСсылка|СправочникОбъект.бит_ПоказателиПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//  СтрНаименование   - Строка.
// 
Функция АвтоНаименование(Показатель)
	
	СтрНаименование = "";
	
	Если Показатель.ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение Тогда
		Если ЗначениеЗаполнено(Показатель.ЭлементДанных) Тогда
			СтрНаименование = Строка(Показатель.ЭлементДанных)+" - "+Строка(Показатель.ИмяРесурса);
		Иначе	
			СтрНаименование = Показатель.Код;
		КонецЕсли; 
	ИначеЕсли Показатель.ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Формула Тогда
		СтрНаименование = Показатель.Формула;
	Иначе	
		СтрНаименование = Показатель.Код;
	КонецЕсли; 
	
	Возврат СтрНаименование;
	
КонецФункции // АвтоНаименование()

#КонецОбласти

#КонецЕсли
